platformio/platform-ststm32/misc/svd/STM32C071.svd
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPSEL17</name>
              <description>Channel-x sampling time selection (x = 22 to 0)
These bits are written by software to define which sampling time is used.
Note: The software is allowed to write this bit only when ADSTART = 0 (which ensures that no conversion is ongoing).
Note: Refer to Section 16.3: ADC implementation for the maximum number of channels.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Sampling time of CHANNELx use the setting of SMP1[2:0] register.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Sampling time of CHANNELx use the setting of SMP2[2:0] register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPSEL18</name>
              <description>Channel-x sampling time selection (x = 22 to 0)
These bits are written by software to define which sampling time is used.
Note: The software is allowed to write this bit only when ADSTART = 0 (which ensures that no conversion is ongoing).
Note: Refer to Section 16.3: ADC implementation for the maximum number of channels.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Sampling time of CHANNELx use the setting of SMP1[2:0] register.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Sampling time of CHANNELx use the setting of SMP2[2:0] register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPSEL19</name>
              <description>Channel-x sampling time selection (x = 22 to 0)
These bits are written by software to define which sampling time is used.
Note: The software is allowed to write this bit only when ADSTART = 0 (which ensures that no conversion is ongoing).
Note: Refer to Section 16.3: ADC implementation for the maximum number of channels.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Sampling time of CHANNELx use the setting of SMP1[2:0] register.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Sampling time of CHANNELx use the setting of SMP2[2:0] register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPSEL20</name>
              <description>Channel-x sampling time selection (x = 22 to 0)
These bits are written by software to define which sampling time is used.
Note: The software is allowed to write this bit only when ADSTART = 0 (which ensures that no conversion is ongoing).
Note: Refer to Section 16.3: ADC implementation for the maximum number of channels.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Sampling time of CHANNELx use the setting of SMP1[2:0] register.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Sampling time of CHANNELx use the setting of SMP2[2:0] register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPSEL21</name>
              <description>Channel-x sampling time selection (x = 22 to 0)
These bits are written by software to define which sampling time is used.
Note: The software is allowed to write this bit only when ADSTART = 0 (which ensures that no conversion is ongoing).
Note: Refer to Section 16.3: ADC implementation for the maximum number of channels.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Sampling time of CHANNELx use the setting of SMP1[2:0] register.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Sampling time of CHANNELx use the setting of SMP2[2:0] register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPSEL22</name>
              <description>Channel-x sampling time selection (x = 22 to 0)
These bits are written by software to define which sampling time is used.
Note: The software is allowed to write this bit only when ADSTART = 0 (which ensures that no conversion is ongoing).
Note: Refer to Section 16.3: ADC implementation for the maximum number of channels.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Sampling time of CHANNELx use the setting of SMP1[2:0] register.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Sampling time of CHANNELx use the setting of SMP2[2:0] register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_AWD1TR</name>
          <displayName>ADC_AWD1TR</displayName>
          <description>ADC watchdog threshold register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LT1</name>
              <description>Analog watchdog 1 lower threshold
These bits are written by software to define the lower threshold for the analog watchdog.
Refer to Section 16.8: Analog window watchdogs on page 329.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HT1</name>
              <description>Analog watchdog 1 higher threshold
These bits are written by software to define the higher threshold for the analog watchdog.
Refer to Section 16.8: Analog window watchdogs on page 329.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_AWD2TR</name>
          <displayName>ADC_AWD2TR</displayName>
          <description>ADC watchdog threshold register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LT2</name>
              <description>Analog watchdog 2 lower threshold
These bits are written by software to define the lower threshold for the analog watchdog.
Refer to Section 16.8: Analog window watchdogs on page 329.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HT2</name>
              <description>Analog watchdog 2 higher threshold
These bits are written by software to define the higher threshold for the analog watchdog.
Refer to Section 16.8: Analog window watchdogs on page 329.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
